confluence/confluence-connector/confluence-connector-1.0.0/org.wso2.carbon.connector/src/test/resources/artifacts/ESB/config/soapAPIRequest/confluence/getBlogEntries.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soap="http://soap.rpc.confluence.atlassian.com"
    xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <soapenv:Header/>
    <soapenv:Body>
        <soap:getBlogEntries soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
            <in0 xsi:type="xsd:string">%s</in0>
            <in1 xsi:type="xsd:string">%s</in1>
        </soap:getBlogEntries>
    </soapenv:Body>
</soapenv:Envelope>
